PIMServicesESB/target/classes/templates/ESB_Billing_ReverseVoucherRequest.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="service">
   <soapenv:Header/>
   <soapenv:Body>
<ser:reverseVoucherList xmlns:ser="service">
         <arg0>
            <MAN>${exchange.properties.PartnerId}</MAN>
            <voucherList>
             <voucherNumber>${exchange.properties.VoucherNumber}</voucherNumber>
			</voucherList>
            <transactionId>${exchange.properties.TransactionSequenceId}</transactionId>
			<userLoginId>${exchange.properties.username}</userLoginId>
</arg0>
</ser:reverseVoucherList>
	     </soapenv:Body>
</soapenv:Envelope>
